In [2]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
data = Series(["one", "two", np.nan, "four"])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [6]:
# if there is a null, returns true
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
# drop null values
data.dropna()

0     one
1     two
3    four
dtype: object

In [22]:
dframe = DataFrame([[1, 2, 3], [np.nan, 5, 6], [7, np.nan, 9], [np.nan, 11, np.nan]])
dframe

     0     1    2
0  1.0   2.0  3.0
1  NaN   5.0  6.0
2  7.0   NaN  9.0
3  NaN  11.0  NaN

In [24]:
# drops any row with null
clean_dframe = dframe.dropna()
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [26]:
# drops rows with ALL nulls
dframe.dropna(how = 'all')

     0     1    2
0  1.0   2.0  3.0
1  NaN   5.0  6.0
2  7.0   NaN  9.0
3  NaN  11.0  NaN

In [28]:
# drop columns instead of rows --- drops any with null values
dframe.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]